In [19]:
import pandas as pd
pd.Series([1.1,2,3,4],index=["a","b","c","d"])

a    1.1
b    2.0
c    3.0
d    4.0
dtype: float64

In [20]:
import numpy as np
x=pd.Series(np.array([1,2,3,4]))
pd.Series(np.arange(1,101))

0       1
1       2
2       3
3       4
4       5
     ...
95     96
96     97
97     98
98     99
99    100
Length: 100, dtype: int32

In [21]:
pd.Series(np.arange(1,101))

0       1
1       2
2       3
3       4
4       5
     ...
95     96
96     97
97     98
98     99
99    100
Length: 100, dtype: int32

In [22]:
np.zeros((4,3))

array([[0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.]])

In [23]:
pd.Series(np.zeros((4,)))

0    0.0
1    0.0
2    0.0
3    0.0
dtype: float64

In [24]:
x[1]

2

In [25]:
x[[0,1,2]]

0    1
1    2
2    3
dtype: int32

In [26]:
x.drop([0,1],inplace=True)

In [27]:
s=pd.Series(np.arange(1,101))
s.drop([0,1])

2       3
3       4
4       5
5       6
6       7
     ...
95     96
96     97
97     98
98     99
99    100
Length: 98, dtype: int32

In [28]:
s.drop([0,1],inplace=True)

In [29]:
s[0]

KeyError: 0

In [33]:
import seaborn as sns 
df=sns.load_dataset('iris')
df.head

<bound method NDFrame.head of      sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]>

In [34]:
df.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [35]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [37]:
df=pd.read_csv

In [39]:
df=pd.read_csv('household_power_consumption.csv')

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 9 columns):
 #   Column                 Non-Null Count    Dtype
---  ------                 --------------    -----
 0   Date                   1048575 non-null  object
 1   Time                   1048575 non-null  object
 2   Global_active_power    1048575 non-null  object
 3   Global_reactive_power  1048575 non-null  object
 4   Voltage                1048575 non-null  object
 5   Global_intensity       1048575 non-null  object
 6   Sub_metering_1         1048575 non-null  object
 7   Sub_metering_2         1048575 non-null  object
 8   Sub_metering_3         1044506 non-null  float64
dtypes: float64(1), object(8)
memory usage: 72.0+ MB

In [41]:
df.head()

,Date,Time,Global_active_power,Global_reactive_power,Voltage,Global_intensity,Sub_metering_1,Sub_metering_2,Sub_metering_3
0,16/12/2006,17:24:00,4.216,0.418,234.84,18.4,0,1,17.0
1,16/12/2006,17:25:00,5.36,0.436,233.63,23,0,1,16.0
2,16/12/2006,17:26:00,5.374,0.498,233.29,23,0,2,17.0
3,16/12/2006,17:27:00,5.388,0.502,233.74,23,0,1,17.0
4,16/12/2006,17:28:00,3.666,0.528,235.68,15.8,0,1,17.0

In [42]:
df.shape

(1048575, 9)

In [43]:
df.describe()

       Sub_metering_3
count    1.044506e+06
mean     5.933837e+00
std      8.210398e+00
min      0.000000e+00
25%      0.000000e+00
50%      0.000000e+00
75%      1.700000e+01
max      3.100000e+01

In [48]:
pd.DataFrame(data=[1,2,3,4],index=['a','b','c','d'],columns=['Name'],)

   Name
a     1
b     2
c     3
d     4

In [60]:
pd.DataFrame(data=[23,20,30,59],index=['1','2','3','4'],columns=['Marks'])

   Marks
1     23
2     20
3     30
4     59

In [56]:
data={'Name':['Priyanshu','Vanshika'],'Marks':[30,30]}
pd.DataFrame(data)

        Name  Marks
0  Priyanshu     30
1   Vanshika     30

In [63]:
pd.DataFrame({'Name':['p1','p2','p3'],'age':[23,24,41],'height':[155,50,165]},index=['a','b','c'])

  Name  age  height
a   p1   23     155
b   p2   24      50
c   p3   41     165